app/controllers/blogs_controller.rb

SELECT `blogs`.* FROM `blogs` ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT `users`.* FROM `users` WHERE `users`.`blog_id` IN ('3', '2', '1')
---
  def index
    @blogs = Blog.includes(:user).order("created_at DESC").page(params[:page]).per(10)

INSERT INTO `blogs` (`title`, `image`, `user_id`, `category_id`, `created_at`, `updated_at`) VALUES ('ブログ始めました！', '海.jpeg', 1, 1, '2020-12-28 02:34:52.923582', '2020-12-28 02:34:52.923582')
---
  def create
    @blog = Blog.new(blog_params)
    binding.pry
    respond_to do |format|
      if @blog.save

UPDATE `blogs` SET `blogs`.`updated_at` = '2020-12-28 02:35:56.340227' WHERE `blogs`.`id` = 1
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 3 LIMIT 1
---
    def set_blog
      @blog = Blog.find(params[:id])