app/controllers/categories_controller.rb

  def index
    @parents = Category.where(ancestry: nil)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`ancestry` IS NULL

  def parent
    category = Category.find(params[:id])
    @category = category.name
    @parent = category.blogs.page(params[:page]).per(10).order("created_at DESC")
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`category_id` = 1 ORDER BY created_at DESC LIMIT 10 OFFSET 0