app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all
---
SELECT `contacts`.* FROM `contacts`

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO `contacts` (`name`, `email`, `content`, `created_at`, `updated_at`, `title`) VALUES ('光', 'test@test.com', 'テストです', '2021-01-06 04:46:07.642425', '2021-01-06 04:46:07.642425', '')

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE `contacts` SET `contacts`.`title` = 'test', `contacts`.`updated_at` = '2021-01-06 05:12:11.386603' WHERE `contacts`.`id` = 2

  def destroy
    @contact.destroy
---
DELETE FROM `contacts` WHERE `contacts`.`id` = 1

    def set_contact
      @contact = Contact.find(params[:id])
---
SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1