app/views/categories/parent.html.haml

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`category_id` = 1
---
  .main-content
    - @category.blogs.each do |blog|
      .blog-content